Revit 2021.1 API
LabelUtils.GetLabelFor Method (DisplayUnitType)
 Gets the user-visible name for a DisplayUnitType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2011
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `GetLabelForUnit(ForgeTypeId)` method instead.")]
public static string GetLabelFor(
	DisplayUnitType displayUnitType
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `GetLabelForUnit(ForgeTypeId)` method instead.")> _
Public Shared Function GetLabelFor ( _
	displayUnitType As DisplayUnitType _
) As String
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `GetLabelForUnit(ForgeTypeId)` method instead.")]
public:
static String^ GetLabelFor(
	DisplayUnitType displayUnitType
)
Parameters
displayUnitType
Type: Autodesk.Revit.DB.DisplayUnitType
 The DisplayUnitType to get the user-visible name.
Remarks
 The name is obtained in the current Revit language.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Cannot find DisplayUnitTypeInfo for the DisplayUnitType.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
LabelUtils Class
GetLabelFor Overload
Autodesk.Revit.DB Namespace